     *> GnuCOBOL Hello World example
      identification division.
      program-id. hello.
      procedure division.
      display    "Hello, world!"
      end-display.
      goback.
