      IDENTIFICATION DIVISION.
      PROGRAM-ID. let.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 n BINARY-LONG VALUE 5.
      PROCEDURE DIVISION.
      DISPLAY "Number" n.