      IDENTIFICATION DIVISION.
      PROGRAM-ID. let-inc.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 n BINARY-LONG VALUE 5.
      PROCEDURE DIVISION.
      SET n UP BY 1
      DISPLAY n.